#coding:UTF-8

import my_config


from kivy.uix.rst import RstDocument
from kivy.core.window import Window
from kivy.app import App


class MyApp(App):
    def build(self):
        import kivy
        text = ""
        text = text + """
这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体
========================================================================================================================
        """

        text = text + 'kivy.__version__ : ' + repr(kivy.__version__)

        text = text + """


This is an **emphased text**, some ``interpreted text``.
And this is a reference to top_::

[color=ff3333]Hello[/color][color=3333ff]World[/color]

+------------------------------+
| paragraph                    |
|                              |
+------------------------------+


+------+-----------------------+
| "- " | list item             |
+------+-----------------------+

+-------+----------------------+
| "1. " | list item            |
+-------+----------------------+

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长
长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的'中文字体_ 12313213213213

这是长长长长长长长长长长长长长长长长长长长长长[color]长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

[color=ff3333]这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体
[color=3333ff]World[/color]
这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体

这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体



这是长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长长的中文字体
------------------------------

中文字体"""
        document = RstDocument(text=text , base_font_size = 80 , on_touch_down = self.on_touch_down)

        #document.colors['link'] = 'ccccccff'
        #document.colors['paragraph'] = 'ce5c00ff'
        #document.render()

        document.scroll_y = 0 #直接滚动到最后一行
        return document
    def on_touch_down(app , self , *args):
        print("on_touch_down : " + repr(args))
        self.text = self.text + '\n \n viewport_size = ' + repr(self.viewport_size)
        
MyApp().run()
